{
  "format": "layers-model",
  "generatedBy": "keras v3.13.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.13.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 224, 224, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            }
          },
          ...rest of your layers...
        ]
      }
    }
  },
  "weightsManifest": [...]
}
